# SpecTypeId.Boolean Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..Boolean Class
SpecTypeId Class Members See Also
---
This class contains constants identifying Boolean specs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static class Boolean
```

Visual Basic
---
```text
Public NotInheritable Class Boolean
```

Visual C++
---
```text
public ref class Boolean abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SpecTypeId..::..Boolean
# See Also
SpecTypeId..::..Boolean Members
Autodesk.Revit.DB Namespace